In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [2]:
%%sql
SELECT * FROM sqlite_master WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [3]:
%%sql

SELECT * FROM facts
LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [4]:
%%sql

SELECT MIN(population),
        MAX(population),
        MIN(population_growth), 
        MAX(population_growth)
FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [8]:
%%sql

SELECT * FROM facts
WHERE population = (SELECT MAX(population) FROM facts) OR population = (SELECT MIN(population) FROM facts)

 * sqlite:///factbook.db
Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None),
 (261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

In [9]:
%%sql

SELECT AVG(population), AVG(area) FROM facts

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

In [10]:
%%sql

SELECT name, population, area FROM facts
WHERE population > (SELECT AVG(population) FROM facts)
AND area < (SELECT AVG(area) FROM facts)

 * sqlite:///factbook.db
Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

In [11]:
%%sql
SELECT name, death_rate, birth_rate, ROUND(death_rate/birth_rate, 2) AS ratio FROM facts
WHERE death_rate/birth_rate >= 1
ORDER BY ratio DESC

 * sqlite:///factbook.db
Done.

[('Bulgaria', 14.44, 8.92, 1.62),
 ('Serbia', 13.66, 9.08, 1.5),
 ('Latvia', 14.31, 10.0, 1.43),
 ('Lithuania', 14.27, 10.1, 1.41),
 ('Hungary', 12.73, 9.16, 1.39),
 ('Monaco', 9.24, 6.65, 1.39),
 ('Germany', 11.42, 8.47, 1.35),
 ('Slovenia', 11.37, 8.42, 1.35),
 ('Ukraine', 14.46, 10.72, 1.35),
 ('Saint Pierre and Miquelon', 9.72, 7.42, 1.31),
 ('Romania', 11.9, 9.14, 1.3),
 ('Croatia', 12.18, 9.45, 1.29),
 ('Greece', 11.09, 8.66, 1.28),
 ('Belarus', 13.36, 10.7, 1.25),
 ('Japan', 9.51, 7.93, 1.2),
 ('Portugal', 11.02, 9.27, 1.19),
 ('Estonia', 12.4, 10.51, 1.18),
 ('Russia', 13.69, 11.6, 1.18),
 ('Italy', 10.19, 8.74, 1.17),
 ('Bosnia and Herzegovina', 9.75, 8.87, 1.1),
 ('Czech Republic', 10.34, 9.63, 1.07),
 ('Moldova', 12.59, 12.0, 1.05),
 ('Poland', 10.19, 9.74, 1.05),
 ('Austria', 9.42, 9.41, 1.0),
 ('European Union', 10.2, 10.2, 1.0)]

In [12]:
%%sql
SELECT name, population_growth FROM facts
ORDER BY population_growth DESC
LIMIT 10

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24),
 ('Qatar', 3.07),
 ('Burkina Faso', 3.03),
 ('Mali', 2.98),
 ('Cook Islands', 2.95),
 ('Iraq', 2.93)]